src/cf/Catalogs/узСпринты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>узСпринты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпринтЗавершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветСпринта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/узСпринты/Ext/ManagerModule.bsl
Функция ПолучитьТекущийСпринт() Экспорт 
	
	
	Только1АктивныйСпринт = Ложь;
	пСпринт = Неопределено;
	ТекстОшибки = Неопределено;
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("Только1АктивныйСпринт",Только1АктивныйСпринт);
	РезультатФункции.Вставить("Спринт",пСпринт);
	РезультатФункции.Вставить("ТекстОшибки",ТекстОшибки);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	узСпринты.Ссылка,
	|	узСпринты.ДатаНачала,
	|	узСпринты.ДатаОкончания,
	|	узСпринты.СпринтЗавершен
	|ИЗ
	|	Справочник.узСпринты КАК узСпринты
	|ГДЕ
	|	НЕ узСпринты.СпринтЗавершен";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ТекстОшибки = "Ошибка! не удалось найти активные спринты";
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Количество() > 1 Тогда
			Только1АктивныйСпринт = Ложь;
		Иначе
			Только1АктивныйСпринт = Истина;
			Выборка.Следующий();
			пСпринт = Выборка.Ссылка;
		Конецесли;
	Конецесли;	
	
	РезультатФункции.Вставить("Только1АктивныйСпринт",Только1АктивныйСпринт);
	РезультатФункции.Вставить("Спринт",пСпринт);
	РезультатФункции.Вставить("ТекстОшибки",ТекстОшибки);	
	Возврат РезультатФункции;

КонецФункции
